Ready for review; here's the dry run of changes:

```
Terraform will perform the following actions:

  # module.simple_server_qa.aws_elasticache_cluster.simple-redis-sidekiq[0] will be created
  + resource "aws_elasticache_cluster" "simple-redis-sidekiq" {
      + apply_immediately      = (known after apply)
      + arn                    = (known after apply)
      + availability_zone      = (known after apply)
      + az_mode                = (known after apply)
      + cache_nodes            = (known after apply)
      + cluster_address        = (known after apply)
      + cluster_id             = "development-qa-sidekiq-elasticache"
      + configuration_endpoint = (known after apply)
      + engine                 = "redis"
      + engine_version         = "5.0.3"
      + id                     = (known after apply)
      + maintenance_window     = (known after apply)
      + node_type              = "cache.t2.small"
      + num_cache_nodes        = 1
      + parameter_group_name   = (known after apply)
      + port                   = 16379
      + replication_group_id   = (known after apply)
      + security_group_ids     = [
          + "sg-0d6114970d2b2fa99",
        ]
      + security_group_names   = (known after apply)
      + snapshot_window        = (known after apply)
      + subnet_group_name      = (known after apply)
      + tags                   = {
          + "Name" = "simple-elasticache-sandbox"
        }
    }

  # module.simple_server_sandbox.aws_elasticache_cluster.simple-redis-sidekiq[0] will be created
  + resource "aws_elasticache_cluster" "simple-redis-sidekiq" {
      + apply_immediately      = (known after apply)
      + arn                    = (known after apply)
      + availability_zone      = (known after apply)
      + az_mode                = (known after apply)
      + cache_nodes            = (known after apply)
      + cluster_address        = (known after apply)
      + cluster_id             = "development-sandbox-sidekiq-elasticache"
      + configuration_endpoint = (known after apply)
      + engine                 = "redis"
      + engine_version         = "5.0.3"
      + id                     = (known after apply)
      + maintenance_window     = (known after apply)
      + node_type              = "cache.t2.small"
      + num_cache_nodes        = 1
      + parameter_group_name   = (known after apply)
      + port                   = 16379
      + replication_group_id   = (known after apply)
      + security_group_ids     = [
          + "sg-0cd3b365051bf3809",
        ]
      + security_group_names   = (known after apply)
      + snapshot_window        = (known after apply)
      + subnet_group_name      = (known after apply)
      + tags                   = {
          + "Name" = "simple-elasticache-sandbox"
        }
    }

  # module.simple_server_security.aws_elasticache_cluster.simple-redis-sidekiq[0] will be created
  + resource "aws_elasticache_cluster" "simple-redis-sidekiq" {
      + apply_immediately      = (known after apply)
      + arn                    = (known after apply)
      + availability_zone      = (known after apply)
      + az_mode                = (known after apply)
      + cache_nodes            = (known after apply)
      + cluster_address        = (known after apply)
      + cluster_id             = "development-security-sidekiq-elasticache"
      + configuration_endpoint = (known after apply)
      + engine                 = "redis"
      + engine_version         = "5.0.3"
      + id                     = (known after apply)
      + maintenance_window     = (known after apply)
      + node_type              = "cache.t2.small"
      + num_cache_nodes        = 1
      + parameter_group_name   = (known after apply)
      + port                   = 16379
      + replication_group_id   = (known after apply)
      + security_group_ids     = [
          + "sg-04ea77f7b55293b14",
        ]
      + security_group_names   = (known after apply)
      + snapshot_window        = (known after apply)
      + subnet_group_name      = (known after apply)
      + tags                   = {
          + "Name" = "simple-elasticache-sandbox"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```